Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: Scan: Clicking this button erases the list of LSS devices and starts an LSS fastscan.
it_it: Scan: Cliccando su questo pulsante si cancella l'elenco dei dispositivi LSS e si avvia una scansione rapida LSS.

source: Schematic
it_it: Schema

source: Schematic Diagram
it_it: Schema Elettrico

source: Screen backlight boost chip
it_it: Chip di boost della retroilluminazione dello schermo

source: Screen brightness
it_it: Luminosità schermo

source: Screen drifting occurs during use, please refer to ESP official FAQ
it_it: Se si verifica un drifting dello schermo durante l'utilizzo, consultare le FAQ ufficiali di ESP

source: Screen parameters
it_it: Parametri dello schermo

source: Search IDs from/to: It is possible to connect more than one module to a CAN bus.
it_it: Search IDs from/to: È possibile collegare più di un modulo a un bus CAN.

source: Search IDs from/to: It is possible to connect more than one module to an RS485 bus.
it_it: Search IDs from/to: È possibile collegare più moduli a un bus RS485.

source: Search Node IDs from/to: It is possible to connect more than one module to a CAN bus.
it_it: Search Node IDs from/to: È possibile collegare più di un modulo a un bus CAN.

source: Section: Here you can select between axis parameters, user variables and input/output ports.
it_it: Section: Qui è possibile selezionare tra parametri degli assi, variabili utente e porte di input/output.

source: Select BOARDS MANAGER in the sidebar;
it_it: Selezionare BOARDS MANAGER nella barra laterale;

source: Select Version Number in the box;
it_it: Selezionare il Numero di Versione nella Casella;

source: Select a TPDO from the list to view and to edit it.
it_it: Selezionare un TPDO dall'elenco per visualizzarlo e modificarlo.

source: Select an RPDO from the list to view and to edit it.
it_it: Selezionare un RPDO dall'elenco per visualizzarlo e modificarlo.

source: Select items: Displays a dialog that allows selecting which parameters are to be displayed in the graph (please see section 4.11.1).
it_it: Select items: Visualizza una finestra di dialogo che consente di selezionare i parametri da visualizzare nel grafico (vedere la sezione 4.11.1).

source: Select the Run function to run the TMCL program which is stored in the module.
it_it: Selezionare la funzione Run per eseguire il programma TMCL memorizzato nel modulo.

source: Select the corresponding development board, take the ESP32S3 motherboard as an example:
it_it: Selezionare la board di sviluppo corrispondente, prendendo come esempio la scheda madre ESP32S3:

source: Select the development board ESP32S3 Dev Module and port
it_it: Selezionare "ESP32S3 Dev Module" e la porta

source: Select the module that is to be updated.
it_it: Selezionare il modulo da aggiornare.

source: Select the object we need to drive, which is our main chip ESP32S3
it_it: Si seleziona l'oggetto da pilotare, ovvero il chip principale ESP32S3.

source: Select the path to save the demo, and require that the demos cannot use folders with the same name
it_it: Selezionare il percorso in cui salvare la demo e impostare che le demo non possano utilizzare cartelle con lo stesso nome

source: Select the project directory correctly and open the project, otherwise it will affect the compilation and flashing of subsequent programs
it_it: Selezionare correttamente la directory del progetto e aprire il progetto, altrimenti ciò influirà sulla compilazione e sull'installazione dei programmi successivi.

source: Select the provided ESP-IDF example and click to select the file (located in the /Demo/ESP-IDF path under demo)
it_it: Selezionare l'esempio ESP-IDF fornito e cliccare per selezionare il file (che si trova nel percorso /Demo/ESP-IDF sotto demo)

source: Select x64 folder.
it_it: Selezionare la cartella x64.

source: Select your current IDF version
it_it: Selezionare la versione IDF attuale

source: SelectFile -->Preferences from the Arduino IDE menu bar
it_it: Selezionare File -->Preferences dalla barra dei menu dell'IDE Arduino

source: Selected items: This shows which items are selected from each section.
it_it: Selected items: Mostra quali elementi sono selezionati da ciascuna sezione.

source: Selecting Stop & Reset from the Debug menu (or clicking the Stop & Reset button or pressing Ctrl+F2) stops the program execution immediately and resets the program.
it_it: Selezionando Stop & Reset dal menù Debug (oppure facendo clic sul pulsante Stop & Reset o premendo Ctrl+F2) l'esecuzione del programma viene interrotta immediatamente e il programma viene reimpostato.

source: Selecting Parameters to be displayed
it_it: Selezione dei Parametri da Visualizzare

source: Selecting the Assemble function in the TMCL menu assembles a file.
it_it: Selezionando la funzione Assemble nel menu TMCL, si assembla un file.

source: Send to TMCL/PC host: instead of writing to a file the TMCL/PC source code can also be directly sent to the TMCL/PC host.
it_it: Send to TMCL/PC host: invece di scrivere su un file, il codice sorgente TMCL/PC può anche essere direttamente spedito all'host TMCL/PC.

source: Sending data to clear the screen (use the right mouse button to paste the data, keyboard shortcuts cannot be used), click SPI once and clear part of them:
it_it: Invio dei dati per cancellare lo schermo (utilizzare il tasto destro del mouse per incollare i dati, le scorciatoie da tastiera non sono utilizzabili), cliccare una volta su SPI e cancellarne una parte:

source: Sending data to light on (use the right mouse button to paste the data, keyboard shortcuts cannot be used), click SPI once and clear part of them:
it_it: Invio dei dati alla luce accesa (utilizzare il tasto destro del mouse per incollare i dati, non è possibile utilizzare le scorciatoie da tastiera), cliccare una volta su SPI e cancellarne una parte:

source: Sensor screw terminal
it_it: Terminale a vite del sensore

source: Serial Self-sending and Receiving Communication in Python Environment
it_it: Comunicazione seriale auto-invio e ricezione in ambiente Python

source: Serial port print indicates successful CAN message transmission.
it_it: La stampa sulla porta seriale indica la corretta trasmissione del messaggio CAN.

source: Serial port prints log, and the screen lights up
it_it: La porta seriale stampa il log e lo schermo si illumina

source: Serial port prints the screen refresh rate, and the screen lights up
it_it: La porta seriale stampa la frequenza di aggiornamento dello schermo e poi si illumina.

source: Serial ports from most manufacturers can be used for this purpose.
it_it: A questo scopo è possibile utilizzare le porte seriali della maggior parte dei produttori.

source: Set IO0 - IO7 pins to output mode, and set the touch screen reset pin (TP_RST) and the LCD reset pin (LCD_RST) to high level while turning off the LCD backlight (LCD_BL) and wait 100 ms.
it_it: Impostare i pin IO0 - IO7 in modalità output e imposta il pin di reset del touchscreen (TP_RST) e il pin di reset del LCD (LCD_RST) a livello alto, spegnendo la retroilluminazione LCD (LCD_BL) e attendendo 100 ms.

source: Set bitrate: This button opens a menu for choosing the CAN bit rate setting of all connected LSS devices.
it_it: Set bitrate: Questo pulsante apre un menu per scegliere l'impostazione del bitrate CAN di tutti i dispositivi LSS connessi.

source: Set bitrate: Use this to change the bitrate of the currently selected device.
it_it: Set bitrate: Utilizza questa opzione per modificare il bitrate del dispositivo attualmente selezionato.

source: Set development board parameters
it_it: Impostare i parametri della scheda di sviluppo

source: Set node ID: This function changes the node ID of the currently selected device.
it_it: Set node ID: Questa funzione modifica l'ID nodo del dispositivo attualmente selezionato.

source: Set the options as necessary:
it_it: Impostare le opzioni secondo necessità:

source: Set to the same baud rate, enter the characters to be sent, select "Add time stamp and packet display", and set "50ms/time, timed send".
it_it: Impostare la stessa velocità in baud, inserire i caratteri da inviare, selezionare "Add time stamp and packet display" [aggiungere orario e visualizza pacchetti], e impostare "50ms/time, timed send" [invio temporizzato].

source: Setting the LSS fastscan timeout to a lower value accelerates this process.
it_it: Impostando il timeout della scansione rapida LSS su un valore inferiore, questo processo viene accelerato.

source: Setting this value to zero makes CoolStep always become active.
it_it: Impostando questo valore su zero, CoolStep si attiverà sempre.

source: Setting this value to zero turns off this feature.
it_it: Impostando questo valore su zero, questa funzione viene disattivata.

source: Settings
it_it: Impostazioni

source: Should normally be enabled.
it_it: Normalmente dovrebbe essere abilitata.

source: Should you have written a wrong value, just write a new value to that object.
it_it: Se si è scritto un valore errato, è sufficiente scrivere un nuovo valore su quell'oggetto.

source: Show Toolbar: If this option is checked then flags can also be shown on a toolbar in the TMCL-IDE main window.
it_it: Show Toolbar: Se questa opzione è selezionata, i flag possono essere visualizzati anche su una barra degli strumenti nella finestra principale di TMCL-IDE.

source: Show in graph: Selects (or deselects) the PDO entry to be displayed in the graphical view.
it_it: Show in graph: Seleziona (o deseleziona) la voce PDO da visualizzare nella vista grafica.

source: Show min/max marker: Selects if marker lines for the actual maximum and minimum values are to be shown.
it_it: Show min/max marker: Seleziona se devono essere visualizzate le linee di marcatura per i valori massimi e minimi effettivi.

source: Since the LVGL API is not thread-safe, the mutex is locked first.
it_it: Poiché l'API LVGL non è thread-safe, il mutex viene bloccato per primo.

source: Single Step: The Single Step function executes only the next command of a program.
it_it: Single Step: La funzione Single Step esegue solo il comando successivo di un programma.

source: Sinus
it_it: Seno

source: Sinus hyperbolicus
it_it: Seno iperbolico

source: Size/Mask: Shows the width of the register (in bits) and which bits can be accessed.
it_it: Size/Mask: Mostra la larghezza del registro (in bit) e a quali bit è possibile accedere.

source: Slow run current (SAP 183): The motor will run using this current when the velocity is below the threshold speed, but greater than zero.
it_it: Slow run current (SAP 183): Il motore funzionerà utilizzando questa corrente quando la velocità è inferiore alla velocità di soglia, ma maggiore di zero.

source: So all the functionality of a chip can be explored in detail.
it_it: In questo modo è possibile esplorare in dettaglio tutte le funzionalità di un chip.

source: So the TMCL Creator is only provided for modules that support stand-alone TMCL programming.
it_it: Pertanto, TMCL Creator è disponibile solo per i moduli che supportano la programmazione TMCL stand-alone.

source: So the following procedure can be used to generate a DCF file:
it_it: Quindi, per generare un file DCF è possibile utilizzare la seguente procedura:

source: So the module definitions can look like this:
it_it: Quindi, le definizioni dei moduli possono apparire così:

source: So, firmware updates can take place via USB, RS232, RS485 or CAN.
it_it: Quindi, gli aggiornamenti del firmware possono avvenire tramite USB, RS232, RS485 o CAN.

source: Software Operation
it_it: Operazione Software

source: Software Revision
it_it: Revisione del Software

source: Software Tools
it_it: Strumenti Software

source: Software and Driver
it_it: Software e Driver

source: Some AppData folders are hidden by default and can be set to show
it_it: Alcune cartelle AppData sono nascoste per default e possono essere impostate per essere visualizzate.

source: Some can also work with more than one module at a time.
it_it: Alcuni possono anche funzionare con più di un modulo contemporaneamente.

source: Some chips are equipped with input pins for configuring the functionality of the chip.
it_it: Alcuni chip sono dotati di pin di ingresso per la configurazione delle funzionalità.

source: Some chips are equipped with registers that provide flags.
it_it: Alcuni chip sono dotati di registri che forniscono flag.

source: Some components are generating logging messages to the file debug.log.
it_it: Alcuni componenti generano messaggi di log nel file debug.log.

source: Some input fields will turn yellow when a new value is being entered.
it_it: Alcuni campi di input diventano gialli quando si inserisce un nuovo valore.

source: Some modules are using different velocity units or have different options for the position mode.
it_it: Alcuni moduli utilizzano unità di velocità diverse o hanno opzioni diverse per la "position mode".

source: Some modules are using different velocity units or have different options for the velocity mode.
it_it: Alcuni moduli utilizzano unità di misura della velocità diverse o hanno opzioni diverse per il "velocity mode".

source: Some of the module specific tools are also used in conjunction with evaluation boards.
it_it: Alcuni strumenti specifici del modulo vengono utilizzati anche in combinazione con le evaluation board.

source: Some of the tools need to regularly poll values from the module.
it_it: Alcuni strumenti devono interrogare regolarmente i valori dal modulo.

source: Some versions of the velocity mode tool also provide an Easy Mode, where the most important parameters can be set using dials or sliders.
it_it: Alcune versioni del tool "velocity mode" offrono anche una Easy Mode, in cui i parametri più importanti possono essere impostati tramite manopole o cursori.

source: Sometimes it may also be necessary to install the driver manually.
it_it: A volte potrebbe anche essere necessario installare il driver manualmente.

source: Specification
it_it: Specifiche

source: Specifications
it_it: Specifiche

source: Specifications are subject to change without notice.
it_it: Le specifiche sono soggette a modifiche senza preavviso.

source: Speed threshold for CoolStep / fullstep: it is possible to switch to fullstep mode and/or to a different chopper scheme when the speed is above the activation velocity for this mode.
it_it: Speed threshold for CoolStep / fullstep: è possibile passare alla modalità fullstep e/o a un diverso schema di chopper quando la velocità è superiore alla velocità di attivazione per questa modalità.

source: Square root
it_it: Radice quadrata

source: Standby Current (SAP 7): the standby current of the motor can also be set using this tool.
it_it: Standby Current (SAP 7): questo strumento consente di impostare anche la corrente di standby del motore.

source: Start velocity and end velocity must not be equal.
it_it: La velocità iniziale e la velocità finale non devono essere uguali.

source: Start: Clicking the Start button re-starts refreshing of the graph.
it_it: Start: Cliccando sul pulsante Start si riavvia l'aggiornamento del grafico.

source: Start: Issues an NMT Start command for all modules connected to the bus.
it_it: Start: Invia un comando NMT Start per tutti i moduli connessi al bus.

source: Start: Issues an NMT Start command for this module.
it_it: Start: Emette un comando NMT Start per questo modulo.

source: Status indicator
it_it: Indicatore di stato

source: Statusword: Here, the statusword is shown as a hexadecimal value.
it_it: Statusword: Qui, la "statusword" viene visualizzata come valore esadecimale.

source: Stepper Motor Modules that use pps Units
it_it: Moduli Motore Passo-Passo che Utilizzano Unità pps

source: Stop: clicking this button will stop the motor.
it_it: Stop: cliccando su questo pulsante si arresta il motore.

source: Stop: Issues an NMT Stop command for all modules connected to the bus.
it_it: Stop: nvia un comando NMT Stop per tutti i moduli connessi al bus.

source: Stop: Issues an NMT Stop command for this module.
it_it: Stop: Emette un comando NMT Stop per questo modulo.

source: Stop: The Stop & Reset function stops the execution of a running program and resets the TMCL/PC interpreter.
it_it: Stop: La funzione Stop & Reset interrompe l'esecuzione di un programma in esecuzione e reimposta l'interprete TMCL/PC.

source: Stop: The Stop button stops the graph so that it can be viewed.
it_it: Stop: Il pulsante Stop arresta il grafico per consentirne la visualizzazione.

source: Store: All connected LSS devices will store their new node ID and bitrate settings permanently.
it_it: Store: Tutti i dispositivi LSS connessi memorizzeranno in modo permanente il nuovo ID nodo e le nuove impostazioni del bitrate.

source: Store: Any changes made to the node ID and/or bitrate settings of the selected device will be stored permanently in its non-volatile memory.
it_it: Store: Qualsiasi modifica apportata all'ID nodo e/o alle impostazioni del bitrate del dispositivo selezionato verrà memorizzata in modo permanente nella sua memoria non volatile.

source: Sub index: The sub index of the object as a decimal value.
it_it: Sub index: Il sottoindice dell'oggetto in decimale.

source: Subtract
it_it: Sottrazione

source: Such flags are shown in the flag view.
it_it: Tali flag vengono visualizzati nella vista flag.

source: Such restrictions are also shown by the Parameter Calculator.
it_it: Tali restrizioni sono visualizzate anche dal "Parameter Calculator".

source: Supplemental Directives
it_it: Direttive Supplementari

source: Support
it_it: Supporto

source: Support Channels
it_it: Canali Supportati

source: Supported Interfaces
it_it: Interfacce Supportate

source: Supports 2.4 GHz Wi-Fi (802.11 b/g/n) and Bluetooth 5 (LE) with onboard antennas
it_it: Supporta Wi-Fi a 2,4 GHz (802.11 b/g/n) e Bluetooth 5 (LE) con antenne integrate

source: Supports 2.4GHz Wi-Fi (802.11 b/g/n) and Bluetooth 5 (BLE), with onboard antenna
it_it: Supporta Wi-Fi a 2,4 GHz (802.11 b/g/n) e Bluetooth 5 (BLE), con antenna integrata

source: Supports capacitive touch control via I2C interface (optional), with 5-point touch, and supports interrupts
it_it: Supporta il controllo touch capacitivo tramite interfaccia I2C (opzionale), con touch a 5 punti e supporto per interrupt

source: Supports flexible clock, module power supply independent setting and other controls to realize low power consumption in different scenarios
it_it: Supporta clock flessibile, impostazione indipendente dell'alimentazione del modulo e altri controlli per ottenere bassi consumi energetici in diversi scenari

source: Switch to Mode1 and connect to the Raspberry Pi, view the device, and see "ch34x_pis*".
it_it: Passare alla Modalità 1 e connettiersi al Raspberry Pi, visualizzare il dispositivo e vedere "ch34x_pis*".

source: Switching on this option considerably reduces the amount of data being displayed in the TMCL Log window.
it_it: L'attivazione di questa opzione riduce notevolmente la quantità di dati visualizzati nella finestra TMCL Log.

source: Symbolic Constants
it_it: Costanti Simboliche

source: Symbolic constants are defined using the following syntax:
it_it: Le costanti simboliche sono definite utilizzando la seguente sintassi:

source: Symbolic constants, floating point numbers, integer numbers, hexadecimal numbers and binary numbers can also be used in constant expressions.
it_it: Anche costanti simboliche, numeri in virgola mobile, numeri interi, numeri esadecimali e numeri binari possono essere utilizzati nelle espressioni costanti.

source: Sync (ms): When the Sync (ms) checkbox is switched on, SYNC commands will be sent periodically.
it_it: Sync (ms): Quando la checkbox Sync (ms) è selezionata, i comandi SYNC verranno inviati periodicamente.

source: TF card clock pin
it_it: Pin di clock della scheda TF

source: TF card enable pin, active low
it_it: Pin di abilitazione della scheda TF, attivo basso

source: TF card input pin
it_it: Pin di ingresso della scheda TF

source: TF card interface: The interface used to connect the TF card.
it_it: TF card interface: Interfaccia utilizzata per collegare la scheda TF.

source: TF card output pin
it_it: Pin di uscita della scheda TF

source: TF card slot
it_it: Slot per scheda TF

source: TF card x 1
it_it: Scheda TF x 1

source: TJA1051 Datasheet
it_it: Datasheet di ST7262

source: TMC429 based Stepper Motor Modules
it_it: Moduli motore passo-passo basati su TMC429

source: TMCL Commands
it_it: Comandi TMCL

source: TMCL/PC is a dialect of TMCL that is executed on a PC as the host computer and is capable of controlling multiple Trinamic motion control modules and/or evaluation boards that are equipped with TMCL.
it_it: TMCL/PC è un dialetto di TMCL che viene eseguito su un PC come computer host ed è in grado di controllare più moduli di controllo del movimento Trinamic e/o evaluation board dotate di TMCL.

source: TMCL/PC programs can be developed and executed using the TMCL/PC host which is integrated into the TMCL-IDE as a container tool.
it_it: I programmi TMCL/PC possono essere sviluppati ed eseguiti utilizzando l'host TMCL/PC, integrato in TMCL-IDE come tool contenitore.

source: TPC file: a TMCL/PC source code file will be generated which can then be used by the TMCL/PC host.
it_it: TPC file: verrà generato un file di codice sorgente TMCL/PC utilizzabile dall'host TMCL/PC.

source: TRINAMIC products are not designed for and must not be used in connection with any applications where the failure of such products would reasonably be expected to result in significant personal injury or death (safety-Critical Applications) without ADI Trinamic’s/Trinamic Motion Control GmbH & Co.
it_it: I prodotti TRINAMIC non sono progettati e non devono essere utilizzati in applicazioni in cui il loro guasto potrebbe ragionevolmente causare lesioni personali gravi o morte (applicazioni critiche per la sicurezza) senza il consenso scritto specifico di ADI Trinamic/Trinamic Motion Control GmbH & Co.

source: Table 1 and table 2 list the supported CAN inter-faces.
it_it: La Tabella 1 e la Tabella 2 elencano le interfacce CAN supportate.

source: Table 1 and table 2 show all currently supported CAN interfaces.
it_it: La tabella 1 e la tabella 2 mostrano tutte le interfacce CAN attualmente supportate.

source: Table 1 contains a list of all CAN interfaces supported by the TMCL-IDE for Windows, and table 2 shows the list of CAN interfaces supported by the Linux version.
it_it: La Tabella 1 contiene un elenco di tutte le interfacce CAN supportate da TMCL-IDE per Windows, mentre la Tabella 2 mostra l'elenco delle interfacce CAN supportate dalla versione Linux.

source: Table 1: List of supported CAN Interfaces (Windows)
it_it: Tabella 1: Elenco delle interfacce CAN supportate (Windows)

source: Table 2: List of supported CAN Interfaces (Linux)
it_it: Tabella 2: Elenco delle interfacce CAN supportate (Linux)

source: Table 3 shows all functions and table 4 shows all operators that can be used in constant expressions.
it_it: La tabella 3 mostra tutte le funzioni e la tabella 4 mostra tutti gli operatori utilizzabili nelle espressioni costanti.

source: Table 3: Functions in Constant Expressions
it_it: Tabella 3: Funzioni nelle Espressioni Costanti

source: Table 4: Operators in Constant Expressions
it_it: Tabella 4: Operatori nelle Espressioni Costanti

source: Tables Index
it_it: Indice delle Tabelle

source: Take ESP32-S3-LCD-1.69 as an example
it_it: Prendiamo come esempio ESP32-S3-LCD-1.69

source: Take care that the interface has been properly installed before trying to use it.
it_it: Assicurarsi che l'interfaccia sia stata installata correttamente prima di utilizzarla.

source: Take the Hello world demo as an example
it_it: Si prende la demo Hello World come esempio
